Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/type/element_slave.po
Languages: cs

source: Slave element
cs: Podřízený prvek

source: The slave elements represent the power circuit devices such the main contactors from power contactors. The slave elements also represent the auxiliary contactors. Even if an auxiliary contactor is part of the command circuit, its activation is forced by another element.
cs: Pomocné prvky znázorňují zařízení silového obvodu, jako jsou hlavnístykače výkonových stykačů. Podřízené prvky také znázorňujípomocné stykače. I když je pomocný stykač součástípříkazového obvodu, jeho zapnutí je vynuceno jiným prvkem.

source: Figure: QElectroTech slave element
cs: Obrázek: Podřízený prvek v QElectroTechu

source: For slave element exist two type of variables, the general variables that are common for all type of elements and managed internally by QElectroTech, and the specific variables for this type of element.
cs: Pro podřízený prvek existují dva typy proměnných, obecné proměnné,které jsou společné pro všechny typy prvků a jsou spravovány vnitřněQElectroTechem, a zvláštní proměnné pro tento typ prvku.

source: QElectroTech does not allow defining variable values for slave element. QElectroTech does also not allows defining new variables. QElectroTech allows only displaying the specific variables at dynamic texts.
cs: QElectroTech neumožňuje stanovit hodnoty proměnných pro podřízený prvek.QElectroTech také neumožňuje stanovit nové proměnné. QElectroTechumožňuje pouze zobrazení konkrétních proměnných u dynamických textů.

source: General variables
cs: Obecné proměnné

source: **% {F}**: Label from the folio where the element can be found
cs: **% {F}**: Štítek listu, kde lze prvek najít

source: **% {f}**: Number from the folio where the element can be found
cs: **% {f}**: Číslo listu, kde lze prvek najít

source: **% {M}**: Plant variable from the folio where the element can be found
cs: **% {M}**: Proměnná plant listu, kde lze prvek najít

source: **% {LM}**: Location variable of the folio where the element can be found
cs: **% {LM}**: Proměnná umístění listu, kde lze prvek najít

source: **% {l}**: Folio line number from the workspace where the element can be found
cs: **% {l}**: Číslo řádku v listu pracovní plochy, kde lze prvek najít

source: **% {c}**: Folio column number from the workspace where the element can be found
cs: **% {c}**: Číslo sloupce v listu pracovní plochy, kde lze prvek najít

source: **% {id}**: Folio position in the project (Schema number)
cs: **% {id}**: Poloha listu v projektu (číslo výkresu)

source: Specific variables
cs: Zvláštní proměnné

source: **Position master element**: Internal pre-defined variable which is automatically displayed under dinamic texts of the element. The default formula from the variable is ``(%id-%l%c)``, variables took from master element.
cs: **Poloha nadřízeného prvku**: Vnitřní předem stanovená proměnná, která jeautomaticky zobrazena pod dynamickými texty prvku. Výchozívzorec proměnné je ``(% id-% l% c)``, proměnné převzaty z nadřízenéhoživel.

source: The default formula from the **Position master element** and the position where it should be displayed can be defined at cross references tab from **New project** preferences.
cs: Výchozí vzorec **Polohy nadřízeného prvku** a polohy,kde má být zobrazen, lze stanovit na kartě křížových odkazů v nastavení pro **Nový projekt**.

source: QElectroTech allows also displaying the specific variables from the `Master element <../../element/type/elementmaster.html>`_ at the dynamic text fields.
cs: QElectroTech také umožňuje zobrazování určitých proměnných`Nadřízeného prvku <../../element/type/elementmaster.html>` _ v dynamickýchtextových polích.
