Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/interface/toolbars.po
Languages: cs

source: Element editor toolbars
cs: Pruhy s nástroji v editoru prvku

source: In addition to the different menus, QElectroTech provides also toolbars. The toolbars are groups of buttons with icons which initiate an accion. In general, these buttons have its counterpart at one of the menus from the `menu bar`_.
cs: Kromě různých `nabídek`_ poskytuje QElectroTech také panely nástrojů. Panely nástrojů jsou skupiny tlačítek s ikonami, které spouštějí činnosti. Obecně mají tato tlačítka protějšek v jedné z nabídek `hlavní nabídky`_.

source: The different toolbars can be hidden or placed in one or more rows below the `menu bar`_. The toolbars can also be placed on column at the left or right side from the main window.
cs: Různé panely nástrojů lze skrýt nebo umístit do jednoho nebo více řádků pod `hlavní nabídkou`_. Panely nástrojů lze také umístit na sloupec nalevo nebo napravo od hlavního okna.

source: To help the user, a tooltip is displayed when the arrow is placed on each button.
cs: Pro pomoc uživateli je nástrojová rada zobrazena, když je šipka umístěna na tlačítku.

source: Toolbar Tools
cs: Nástroje v pruhu s nástroji

source: Figure: QElectroTech element editor toolbar Tools
cs: Obrázek: Nástroje v pruhu s nástroji v editoru prvku v QElectroTechu

source: The different buttons from toolbar **Tools** are:
cs: Různá tlačítka na panelu nástrojů **Nástroje** jsou:

source: Tool
cs: Nástroj

source: Function
cs: Funkce

source: Keyboard shortcut
cs: Klávesová zkratka

source: Icon
cs: Ikona

source: New
cs: Nový

source: Creates a new element
cs: Vytvoří nový prvek

source: Open
cs: Otevřít

source: Opens an existing element from collection
cs: Otevře stávající prvek ve sbírce

source: Save
cs: Uložit

source: Saves the current element changes (overwrites)
cs: Uloží nynější změny prvku (přepíše)

source: Save as
cs: Uložit jako

source: Saves the element as a new element from a library
cs: Uloží prvek jako nový prvek v knihovně

source: Reload
cs: Nahrát znovu

source: Reloads the opened element (all changes which are not saved are lost)
cs: Nahraje otevřený prvek (všechny změny, které nejsou uloženy, jsou ztraceny)

source: Undo
cs: Zpět

source: Undoes the previous action
cs: Vrátí zpět předchozí krok

source: Redo
cs: Znovu

source: Restores the undone action
cs: Obnoví krok vrácený zpět

source: Delete
cs: Smazat

source: Removes selected elements from the folio
cs: Odebere vybrané prvky z listu

source: Select **Settings > Display > Tools** menu item to display or hidden the toolbar **Tools**.
cs: Pro zobrazení nebo skrytí panelu nástrojů **Nástroje** vyberte položku nabídky **Nastavení > Zobrazení > Nástroje**.

source: Toolbar Display
cs: Pruh s nástroji pro zobrazení

source: Figure: QElectroTech element editor toolbar Display
cs: Obrázek: Zobrazení pruhu s nástroji v editoru prvku v QElectroTechu

source: The different buttons from toolbar **Display** are:
cs: Různá tlačítka na panelu nástrojů **Zobrazení** jsou:

source: Select **Settings > Display > Display** menu item to display or hidden the toolbar **Display**.
cs: Pro zobrazení nebo skrytí panelu nástrojů **Zobrazení** vyberte položku nabídky **Nastavení > Zobrazení > Zobrazení**.

source: Toolbar Element
cs: Prvek v pruhu s nástroji

source: Figure: QElectroTech element editor toolbar Element
cs: Obrázek: Prvek v pruhu s nástroji v editoru prvku v QElectroTechu

source: The different buttons from toolbar **Element** are:
cs: Různá tlačítka na panelu nástrojů **Prvek** jsou:

source: Information
cs: Informace

source: Edit name and information of the element
cs: Upravit název a údaje o prvku

source: Properties
cs: Vlastnosti

source: Edit element properties
cs: Upravení vlastností prvku

source: Select **Settings > Display > Diagrams** menu item to display or hidden the toolbar **Element**.
cs: Pro zobrazení nebo skrytí panelu nástrojů **Prvek** vyberte položku nabídky **Nastavení > Zobrazení > Výkresy**.

source: Toolbar Parts
cs: Pruh s nástroji pro části

source: Figure: QElectroTech element editor toolbar Parts
cs: Obrázek: Pruh s nástroji pro části v editoru prvku v QElectroTechu

source: The different buttons from toolbar **Parts** are:
cs: Různá tlačítka na panelu nástrojů **Části** jsou:

source: Line
cs: Čára

source: Add line to the workspace
cs: Přidat čáru do pracovní plochy

source: Rectangle
cs: Obdélník

source: Add rectangle to the workspace
cs: Přidat obdélník do pracovní plochy

source: Ellipse
cs: Elipsa

source: Add ellipse to the workspace
cs: Přidat elipsu do pracovní plochy

source: Polygon
cs: Mnohoúhelník

source: Add polygon to the workspace
cs: Přidat mnohoúhelník do pracovní plochy

source: Add text field to the workspace
cs: Přidat text do pracovní plochy

source: Arc
cs: Oblouk

source: Add arc to the workspace
cs: Přidat oblouk do pracovní plochy

source: Terminal
cs: Svorka

source: Add terminal to the workspace
cs: Přidat svorku do pracovní plochy

source: Text field
cs: Textové pole

source: Add dynamic text field to the workspace
cs: Přidat dynamické textové pole do pracovní plochy

source: Select **Settings > Display > Diagrams** menu item to display or hidden the toolbar **Parts**.
cs: Pro zobrazení nebo skrytí panelu nástrojů **Části** vyberte položku nabídky **Nastavení > Zobrazení > Výkresy**.

source: Toolbar Depth
cs: Pruh s nástroji pro hloubku

source: Figure: QElectroTech element editor toolbar Depth
cs: Obrázek: Pruh s nástroji pro hloubku v editoru prvku v QElectroTechu

source: The different buttons from toolbar **Depth** are:
cs: Různá tlačítka na panelu nástrojů **Hloubka** jsou:

source: Bring forward
cs: Přesunout dopředu

source: Brings the selection (s) to front
cs: Přesune výběr dopředu (s)

source: Raise
cs: Zvýšit

source: Aproachs the selection (s)
cs: Přistoupí k výběru (s)

source: ``Ctrl + shift + Up``
cs: ``Ctrl + Shift + Nahoru``

source: Lower
cs: Snížit

source: Moves away the selection (s)
cs: Vzdálí výběr (s)

source: ``Ctrl + shift + Down``
cs: ``Ctrl + Shift + Dolů``

source: Send backwards
cs: Přesunout dozadu

source: Sends in the backwards the selection (s)
cs: Přesune výběr dozadu (s)

source: Select **Settings > Display > Diagrams** menu item to display or hidden the toolbar **Depth**.
cs: Pro zobrazení nebo skrytí panelu nástrojů **Hloubka** vyberte položku nabídky **Nastavení > Zobrazení > Výkresy**.
