Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/layers.po
Languages: cs

source: Object layer level
cs: Úroveň vrstvy předmětu

source: Overlaping of `elements`_ or `pictures`_ may occur at `workspace`_, QElectroTech allows defining the level order from `elements`_ and `pictures`_ at each `folio`_.
cs: Na `pracovní ploše`_ může docházet k překrývání `prvků`_ nebo `obrázků`_. QElectroTech umožňuje stanovit pořadí úrovní `prvků`_ a `obrázků`_ v každém `listu`_.

source: QElectroTech allows the following actions:
cs: QElectroTech umožňuje následující činnosti:

source: Icon
cs: Ikona

source: Action
cs: Činnost

source: Definition
cs: Popis

source: Keyboard shortcut
cs: Klávesová zkratka

source: Bring to front
cs: Dát úplně nahoru

source: Brings the selection (s) to front
cs: Přesune výběr dopředu (s)

source: Raise
cs: Dát nahoru

source: Aproachs the selection (s)
cs: Přistoupí k výběru (s)

source: ``Ctrl + Shift + Up``
cs: ``Ctrl + Shift + Nahoru``

source: Lower
cs: Dát dolů

source: Moves away the selection (s)
cs: Vzdálí výběr (s)

source: ``Ctrl + Shift + Down``
cs: ``Ctrl + Shift + Dolů``

source: Send backwards
cs: Dát úplně dolů

source: Sends in the backwards the selection (s)
cs: Přesune výběr dozadu (s)

source: The layer level from multiples objects can be defined at the same time `selecting multiple objects`_.
cs: Ve stejnou dobu lze po `vybrání více předmětů`_ stanovit úroveň vrstvy více předmětů.

source: The level from each `element`_ or `picture`_ can be defined from `menu bar`_, `toolbar`_, by right click on the object and using the corresponding keyboard shortcut.
cs: Úroveň každého `předmětu`_ nebo `obrázku`_ lze stanovit přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem na předmět a pomocí odpovídající klávesové zkratky.

source: Define object layer from menu bar
cs: Stanovení vrstvy předmětu přes hlavní nabídku

source: `Select the object/s`_ which layer level should be defined.
cs: `Vyberte předmět(y)`_, jehož úroveň vrstvy má být stanovena.

source: Select **Edit** menu and the desired action.
cs: Vyberte hlavní nabídku **Úpravy** a požadovanou činnost.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Define object layer from toolbar
cs: Stanovení vrstvy předmětu přes pruh s nástroji

source: Select the corresponding icon from `toolbar`_ (icons from above table) to realize the desired action.
cs: Vyberte odpovídající ikonu v `panelu nástrojů`_ (ikony z výše uvedené tabulky) pro uskutečnění požadované činnosti.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Depth**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Hloubka**

source: Define object layer by right click
cs: Stanovení vrstvy předmětu klepnutím pravým tlačítkem myši

source: Right click and select the desired layer definition action.
cs: Klepněte pravým tlačítkem myši a vyberte činnost stanovení požadované vrstvy.

source: Figure: QElectroTech element right click items
cs: Obrázek: Položky po klepnutí pravým tlačítkem myši na prvek v QElectroTechu

source: Define object layer using keyboard shortcut
cs: Stanovení vrstvy předmětu pomocí klávesové zkratky

source: As many other tools, QElectroTech is an applications which allows using keyboard shortcut.
cs: Stejně jako mnoho dalších nástrojů, QElectroTech je program, který umožňuje použití klávesové zkratky.

source: Press the corresponding keyboard shortcut (keyboard shortcut from above table) to realize the desired action.
cs: Stiskněte příslušnou klávesovou zkratku (klávesová zkratka z hořejší tabulky) k provedení požadované činnosti.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
