Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/properties/display.po
Languages: cs

source: Display folio properties
cs: Zobrazení vlastností listu

source: The `folio properties`_ can be common at all `folios`_ from the same `project`_. QElectroTech also allows that each `folio`_ has its own properties. For example, two `folios`_ can be created by different authors or they can have different revision item.
cs: `Vlastnosti listu`_ mohou být společné pro všechny `listy`_ stejného `projektu`_. QElectroTech také umožňuje, aby každý `list`_ měl své vlastní vlastnosti. Například dva `listy`_ mohou být vytvořeny různými autory nebo mohou mít různé změnové položky.

source: To reduce the creation time, QElectroTech allows creating some pre-setting for all future `folios`_ that will be created at the `project`_. For more information about how to pre-define `folio properties`_, refer to `project properties`_ section.
cs: Pro zkrácení doby vytvoření QElectroTech umožňuje vytvořit přednastavení pro všechny budoucí `listy`_, které budou vytvořeny v` projektu`_. Další informace o tom, jak předem stanovit `vlastnosti listu`_, najdete v části `vlastnosti projektu`_.

source: The folio properties window can be displayed from `menu bar`_, `workspace`_, `toolbar`_, `projects panel`_, `folios tabs bar`_ and using the corresponding keyboard shortcut.
cs: Okno s vlastnostmi listu lze zobrazit přes `hlavní nabídku`_, `pracovní plochu`_,` panel nástrojů`_, `panel projektů`_ `pruh karet s listy`_ a pomocí příslušné klávesové zkratky.

source: Display folio properties from menu bar
cs: Zobrazení vlastností listu přes hlavní nabídku

source: Select **Edit > Folio properties** menu item to display `folio properties`_ from the active `folio`_.
cs: Pro zobrazení `vlastností listu`_ z činného `listu`_ vyberte položku nabídky **Úpravy > Vlastnosti listu**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Display folio properties from workspace
cs: Zobrazení vlastností listu z pracovní plochy

source: Right click on the `workspace`_ area. Should be somewhere without any `element`_, `conductor`_, `table`_, etc.
cs: Klepněte pravým tlačítkem myši na oblast `pracovní plochy`_. Mělo by to být někde bez `prvku`_, `vodiče`_, `tabulky`_ atd.

source: Click the option **Folio properties** to display `folio properties`_ from the active `folio`_.
cs: Pro zobrazení `vlastností listu`_ z činného `listu`_ klepněte na volbu **Vlastnosti listu**.

source: Figure: QElectroTech Workspace Menu
cs: Obrázek: Nabídka pracovní plochy v QElectroTechu

source: Display folio properties from toolbar
cs: Zobrazení vlastností listu přes pruh s nástroji

source: Select the icon |dialog-information| from `toolbar`_ to display `folio properties`_ from the active `folio`_.
cs: Pro zobrazení `vlastností listu`_ z činného `listu`_ vyberte ikonu |dialog-information| v `nástrojovém panelu`_

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Diagram**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Diagram**.

source: Display folio properties from projects panel
cs: Zobrazení vlastností listu přes panel s projekty

source: Right click on the `folio`_ where any property should be defined, it can be an inactive `folio`_ from an inactive `project`_.
cs: Klepněte pravým tlačítkem myši na `list`_, kde se má stanovit nějaká vlastnost. Může to být nečinný `list`_ nečinného `projektu`_.

source: Click the option **Folio properties** to display `folio properties`_ from the selected `folio`_.
cs: Pro zobrazení `vlastností listu`_ z vybraného `listu`_ klepněte na volbu **Vlastnosti listu**.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `projects panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**

source: Display folio properties from folios tabs bar
cs: Zobrazení vlastností listu přes pruh karet s listy

source: Doble click on the `folio tab`_ to display `folio properties`_.
cs: Pro zobrazení `vlastností listu`_ dvakrát klepněte na `kartu s listem`_

source: Figure: QElectroTech folio tabs bar
cs: Obrázek: Pruh karet s listy v QElectroTechu

source: Display folio properties using keyboard shortcut
cs: Zobrazení vlastností listu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + l`` to display `folio properties`_ from the active `folio`_.
cs: Pro zobrazení `vlastností listu`_ z činného `listu`_ stiskněte ``Ctrl + l``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
