Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/replace/text_field_replace.po
Languages: cs

source: Replace text field content
cs: Nahrazení obsahu textového pole

source: QElectroTech provides the feature of searching and replacing `text field`_ content automatically. This option allows replacing the complete content from a `text field`_ which contains the string searched. The string searched can be the complete `text field`_ content or part of the `text field`_ content.
cs: QElectroTech poskytuje funkci vyhledávání a nahrazování obsahu `textového pole`_ automaticky. Tato možnost umožňuje nahradit celý obsah `textového pole`_, které obsahuje hledaný řetězec. Hledaným řetězcem může být úplný obsah `textového pole`_ nebo část obsahu `textového pole`_.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky ** Úpravy > Hledat/Nahradit**.

source: To replace `text field`_ content over a `project`_:
cs: Pro nahrazení obsahu `textového pole`_ v `projektu`_:

source: `Search`_ the string which should be replaced (Ex.: Folio).
cs: `Hledejte`_ řetězec, který se má nahradit (například: List).

source: Figure: QElectroTech search menu
cs: Obrázek: Nabídka pro vyhledávání v QElectroTechu

source: Define the new text content at the replace text box (Ex.: Sheet reserve).
cs: Stanovte nový obsah textu v poli pro nahrazení textu (například: Rezerva listu).

source: Select at the objects tree the `text fields`_ which content should be replaced.
cs: Ve stromu předmětů vyberte `textová pole`_, jejichž obsah se má nahradit.

source: Press **Replace all** button to replace the content from the selected `text fields`_.
cs: Stiskněte tlačítko **Nahradit vše** pro nahrazení obsahu vybraných `textových polí`_.

source: Press actualize |view-refresh| button to refresh the search.
cs: Pro obnovení vyhledávání stiskněte tlačítko Aktualizovat |view-refresh|.

source: Replacing action can also be applied object by object. The button **Replace** will only apply the action to the displayed object at the `workspace`_. The buttons |go-top| and |go-bottom| can be used to display the previous and next `text field`_ from the search result.
cs: Nahrazovací úkon lze také provést `předmět`_ za `předmětem`_ Tlačítko **Nahradit** úkon provede pouze na v `pracovní ploše`_ zobrazeném `předmětu`_ . Tlačítka |go-top| a |go-bottom| lze použít k zobrazení předchozího a dalšího `předmětu`_ výsledku vyhledávání.

source: The replacing feature from QElectroTech replaces the `text field`_ content completely. Changing the `text field`_ content partly cannot be done.
cs: Funkce nahrazení v QElectroTechu nahradí obsah `textového pole`_ úplně. Částečně měnit obsah `textového pole` nelze.
