Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/create_element.po
Languages: cs

source: Create element
cs: Vytvoření prvku

source: Working with collections can only be done from the collections panel. Before starting to work with collections, the collections panel has to be displayed.
cs: Práce se sbírkami lze provádět pouze v panelu se sbírkami. Před zahájením práce se sbírkami musí být zobrazen panel se sbírkami.

source: Select **Settings > Display > Collections** menu item to display the Collections panel.
cs: Pro zobrazení panelu se sbírkami vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: QElectroTech allows creating element at some collection. The user has only read rights at QET element collection, the user can create element at all collections except QET collection.
cs: QElectroTech umožňuje vytvoření prvku v některé ze sbírek. Uživatel si má pouze přečíst práva pro sbírku prvků QET. Uživatel může prvek vytvořit ve všech sbírkách kromě sbírky QET.

source: There is two different ways to create a new eleemnt at the user collection. A new element can be created from cero or from an already existing element from the QET or user collection.
cs: Jsou dva různé způsoby, jak v uživatelské sbírce vytvořit nový prvek. Nový prvek lze vytvořit od nuly nebo z již vytvořeného ve sbírce QET nebo v uživatelské sbírce jsoucího prvku.

source: Create element from cero
cs: Vytvoření prvku od nuly

source: Right click on the user collection or at the category / sub-category from the collection where the new element should be added.
cs: Klepněte pravým tlačítkem na uživatelskou sbírku nebo na skupinu/podskupinu ve sbírce, do které se má přidat nový prvek.

source: Figure: Options at folder
cs: Obrázek: Volby pro složku

source: Click the option **New element** to start the element creation.
cs: Pro zahájení tvorby prvku klepněte na volbu **Nový prvek**.

source: Confirm or change the category from the element.
cs: Potvrďte nebo změňte skupinu prvku.

source: Define the element file name.
cs: Stanovte název souboru prvku.

source: Figure: File name definition PopUP window
cs: Obrázek: Vyskakovací okno pro stanovení názvu souboru v QElectroTechu

source: Define the element name for the collection and project tree. It can be defined in many languajes.
cs: Stanovte název prvku pro strom sbírky a projektu. Může být stanoven v mnoha jazycích.

source: Figure: Element name definition PopUP window
cs: Obrázek: Vyskakovací okno pro stanovení názvu prvku v QElectroTechu

source: QElectroTech works according `ISO 639-1`_ norm. The element name languaje is defined using 2 letter code which should be used at the languaje column from the folder internal name table.
cs: QElectroTech pracuje podle normy `ISO 639-1`_. Jazyk názvu prvku je stanoven pomocí dvojpísmenného kódu, který se má použít ve sloupci jazyka tabulky hodnot buňky.

source: Once the element editor PopUP window is opened, design the symbol element and define the properties.
cs: Po otevření vyskakovacího okna editoru prvků navrhněte prvek symbolu a stanovte vlastnosti.

source: Save the element and it will appear at the collection.
cs: Uložte prvek a objeví se ve sbírce.

source: For more information about the element editor, refer to `Element editor <../../../en/element/elementeditor/index.html>`_ section.
cs: Další informace o tom editoru prvků najdete v části `editor prvků <../../../en/element/elementeditor/index.html>`_

source: Create an element from an existing element
cs: Vytvoření prvku ze stávajícího prvku

source: Right click on the element which will be used as base for the new element.
cs: Klepněte pravým tlačítkem na prvek, který bude použit jako základ pro nový prvek.

source: Figure: Options at element
cs: Obrázek: Volby při prvku

source: Click the option **Edit element** to open the element at the element editor.
cs: Pro otevření prvku v editoru prvků klepněte na volbu **Upravit prvek**.

source: Select **File > Save as** menu item to open the save window.
cs: Pro otevření ukládacího okna vyberte položku nabídky **Soubor > Uložit jako**.

source: Choose the element category at the collection tree.
cs: Vyberte skupinu prvku ve stromu sbírky.

source: Define the file name for the element.
cs: Stanovte název souboru prvku.

source: Press the button **Save**.
cs: Stiskněte tlačítko **Uložit**.
