Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/conductor/conductor_change_appearance.po
Languages: cs

source: Change appearance conductor
cs: Změna vzhledu vodiče

source: QElectroTech allows changing the `conductors appearance`_, the line style and color can be defined for each `conductor`_.
cs: QElectroTech umožňuje měnit `vzhled vodičů`_. Styl čárya barvu lze stanovit pro každý `vodič`_.

source: To change the conductor appearance:
cs: Pro změnu vzhledu vodiče:

source: `Select the conductor`_ which should be edited.
cs: `Vyberte vodič`_, který se má upravit.

source: `Display conductor properties`_ PopUp window.
cs: Vyskakovací okno pro `zobrazení vlastností vodiče`_.

source: Go to **Appearance** tab.
cs: Jděte na kartu **Vzhled**.

source: Figure: QElectroTech conductor appearance PopUP window
cs: Obrázek: Vyskakovací okno pro vzhled vodiče v QElectroTechu

source: Choose the desired parameters for main color and secondary color if necessary.
cs: Zvolte požadované parametry pro základní barvu a druhotnou barvu, pokudje to nutné.

source: 5. Click the check buttom **Apply properties to all conductor of this potential** if the changes should be applied for all `conductor`_ with common initial or end `terminal`_. 5. Click or unclick the option **Apply properties to all conductors of this potential**. 6. Press **OK** button to save and apply the property changes.
cs: 5. Klepněte na zaškrtávací tlačítko **Použít vlastnosti na všechny vodiče o tomto potenciálu**, pokud by změny měly být použity pro všechny `vodiče`_ sespolečnou počáteční nebo koncovou `svorkou`_. 5. Klepněte nebo zrušte volbu **Použít vlastnosti na všechny vodiče o tomto potenciálu**. 6. Stiskněte tlačítko **OK**pro uložení a použití změn vlastností.

source: For more information about conductor appearance, refer to `conductor appearance`_ section.
cs: Další informace o vzhledu vodičů naleznete v části `vzhled vodiče`_.
