Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/element_save.po
Languages: cs

source: Save element
cs: Uložení prvku

source: The current `element`_ can be saved from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Nynější `prvek`_ lze uložit přes `hlavní nabídku`_, `panel nástrojů`_ apomocí odpovídající klávesové zkratky.

source: One `element`_ is only conformed by one file with format ``.elmt``. The ``.elmt`` extension is the native extension from QElectroTech `elements`_.
cs: Jeden `prvek`_ odpovídá jednomu souboru ve formátu``.elmt`` Přípona ``.elmt`` je původní přípona `prvků`_ QElectroTechu.

source: Save element from menu bar
cs: Uložení prvku přes hlavní nabídku

source: Select **File > Save** menu item to save the element changes.
cs: Pro uložení změn v `prvku`_ vyberte položku nabídky **Soubor > Uložit**.

source: Figure: QElectroTech element editor file menu
cs: Obrázek: Nabídka Soubor editoru prvku v QElectroTechu

source: At the case that the opened `element`_ has to overwrite an existing `element`_ or it has to be saved as a new `element`_:
cs: V případě, že otevřený `prvek`_ musí přepsat stávající`prvek`_ nebo musí být uložen jako nový `prvek`_:

source: Select **File > Save as** menu item to display the **Save as element** PopUP window.
cs: Pro zobrazení vyskakovacího okna **Uložit jako prvek** vyberte položku nabídky **Soubor > Uložit* jako*.

source: Figure: QElectroTech element editor save as PopUP window
cs: Obrázek: Vyskakovací okno pro uložit jako v editoru prvku v QElectroTechu

source: Select the `element`_ which should be overwrited or the `category`_ and the name for the new `element`_.
cs: Vyberte `prvek`_, který má být přepsán, nebo `skupinu`_ a název nového `prvku`_.

source: Press the **Save** button to save the `element`_ and close the PopUP window.
cs: Pro uložení `prvku`_ stiskněte tlačítko **Uložit** a zavřete vyskakovací okno.

source: The `element`_ can also be directly saved as a new file in the Hard Disk directory desired:
cs: `Prvek`_ lze také přímo uložit jako nový soubor do požadovaného adresáře na pevném disku:

source: Select **File > Save to a file** menu item to display the file system PopUp window.
cs: Pro zobrazení vyskakovacího okna se souborovým systémem vyberte položku nabídky **Soubor > Uložit do souboru**.

source: Select the directory and the name from the element file.
cs: Vyberte adresář a název ze souboru prvku.

source: Press **Save** button to save the `element`_ and close the PopUP window.
cs: Pro uložení `prvku`_ stiskněte tlačítko **Uložit** a zavřete vyskakovací okno.

source: Save element from toolbar
cs: Uložení prvku přes pruh s nástroji

source: Select the icon |document-save| from `toolbar`_ to save the element changes.
cs: Pro uložení změn v prvku vyberte v `panelu nástrojů`_ ikonu |document-save|.

source: Select the icon |document-save-as| from `toolbar`_ to display the **Save as element** PopUP window.
cs: Pro zobrazení vyskakovacího okna **Uložit jako prvek** v `panelu nástrojů`_vyberte ikonu |document-save-as|.

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Nástroje**

source: Save element using keyboard shortcut
cs: Uložení prvku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + s`` to save the element changes.
cs: Pro uložení změn v `prvku`_ stiskněte ``Ctrl + S``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
