Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/paste.po
Languages: cs

source: Paste part
cs: Vložení části

source: QElectroTech element editor allows pasting the different possible `type of parts`_ which have already been copied or cut from the `drawing area`_.
cs: Editor prvku v QElectroTechu umožňuje vkládání různých možných `typů částí`_, které již byly zkopírovány nebo vyříznuty z `kreslicí plochy`_.

source: Multiples `parts`_ can be pasted at the same time, check `copy part`_ or `cut part`_ section to check how multiples `parts`_ can be copied or cut.
cs: Současně lze vložit více `částí`_ . Zkontrolujte část `kopírovat část`_ nebo `vyjmout část`_, abyste měli vládu nad tím, kolik `částí`_ lze zkopírovat nebo vyjmout.

source: Pasting `parts`_ can be done from `menu bar`_, by right click on the `drawing area`_ and using the corresponding keyboard shortcut.
cs: Vkládání `částí` lze provádět přes `hlavní nabídku`_, klepnutím pravým tlačítkem na `kreslicí plochu`_ a pomocí odpovídající klávesové zkratky.

source: Paste part from menu bar
cs: Vložení části přes hlavní nabídku

source: Select **Edit > Paste** menu item to paste the `part`_ copied or cut previously from `drawing area`_.
cs: Pro vložení předtím v `kreslicí ploše`_ zkopírované nebo z ní vyjmuté `části`_ vyberte položku nabídky **Úpravy > Vložit**.

source: Figure: QElectroTech element editor Edit menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Paste part by right click
cs: Vložení části klepnutím pravým tlačítkem myši

source: Right click somewhere from `drawing area`_.
cs: Klepněte pravým tlačítkem myši někam v `kreslicí ploše`_

source: Select the option **Paste** to paste the `part`_ copied or cut previously.
cs: Pro vložení předtím zkopírované nebo vyjmuté `části`_ vyberte volbu **Vložit**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Paste part using keyboard shortcut
cs: Vložení části pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + v`` to paste the `part`_ copied or cut previously from `drawing area`_.
cs: Pro vložení předtím v `kreslicí ploše`_ zkopírované nebo z ní vyjmuté `části`_ stiskněte ``Ctrl + v``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.

source: The procedure defined at this section only allows pasting the `parts`_ at the right grid point from the copied or cut `part`_ position. To be able to choose the place where the `part`_ has to be pasted, refer to `paste in area`_ section.
cs: Postup stanovený v této části umožňuje vložení `částí`_ ze zkopírované nebo vyjmuté polohy `části`_ pouze na vhodný bod mřížky. Abyste mohli vybrat místo, kam se má `část`_ vložit, podívejte se na část `Vložit do oblasti`_.
