Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/reports/nomenclature/create_nomenclature.po
Languages: cs

source: Create nomenclature
cs: Vytvoření seznamu součástí

source: A `project`_ is a combination / assembly of `elements`_ / components, QElectroTech provides the feature to create a nomenclature, also known as Bill Of Materials (BOM), which shows the information about the different `elements`_ / components. QElectroTech allows creating the nomenclature automatically.
cs: `Projekt`_ je kombinace / sestava` prvků`_ / součástek, QElectroTech poskytuje funkci pro vytvoření seznamu součástí, známé také jako kusovník (BOM), který zobrazuje informace o různých `prvcích`_ / součástkách. QElectroTech umožňuje vytvoření seznamu součástí automaticky.

source: Figure: QElectroTech Bill Of Materials (BOM)
cs: Obrázek: Kusovník v QElectroTechu

source: To create a project nomenclature:
cs: Pro vytvoření seznamu součástí projektu:

source: Activate the folio where the nomenclature table has to be created.
cs: Vyvolejte list, v němž má být tabulka se seznamem součástí vytvořena.

source: Select **Project > Add a nomenclature** to display the configuration PopUp window of the nomenclature creator.
cs: Pro zobrazení vyskakovacího okna s nastavením seznamu součástí vyberte **Projekt > Přidat seznamu součástí**.

source: Figure: QElectroTech project menu
cs: Obrázek: Nabídka pro projekt v QElectroTechu

source: Go to **Display** tab to define display table properties.
cs: Pro stanovení vlastností zobrazené tabulky jděte do **Zobrazení**.

source: Define the **Table name** which will identify the table.
cs: Stanovte **Název tabulky**, který tabulku odliší.

source: Configure the display table settings (header and table cells properties, auto adjustment of table size, etc.).
cs: Nastavte zobrazení tabulky (vlastnosti záhlaví a buněk tabulky, automatické přizpůsobení velikosti tabulky atd.).

source: Go to **Content** tab to define table columns.
cs: Pro stanovení sloupců tabulky jděte do karty **Obsah**.

source: Modify the list of information to be displayed according the commands of the following table.
cs: Upravte seznam informací, které se mají zobrazit, pomocí příkazů v následující tabulce.

source: Icon
cs: Ikona

source: Action
cs: Činnost

source: Keyboard shortcut
cs: Klávesová zkratka

source: Move up this field
cs: Posunutí pole nahoru

source: Add field to display list
cs: Přidání pole do seznamu zobrazených

source: Double click on field at available list
cs: Dvakrát klepněte na pole v seznamu dostupných

source: Remove field from display list
cs: Odstranění pole ze seznamu zobrazených

source: Double click on field at display list
cs: Dvakrát klepněte na pole v seznamu zobrazených

source: Move down this field
cs: Posunutí pole dolů

source: The content request configuration can be saved and chosen from **Configuration** section to increase working efficiency.
cs: Nastavení požadavku na obsah lze uložit a zvolitv části **Nastavení** pro zvýšení účinnosti práce.

source: QElectroTech is working with SQLite database, nomenclature table content can also be defined by SQL query.
cs: QElectroTech pracuje s databází SQLite, obsah tabulky se seznamem součástí může být stanoven také dotazem SQL.

source: Define the filtering parameters (**Filter by** and type of `elements`_).
cs: Stanovte parametry filtrování (**Filtrovat podle** a typ `prvků`_).

source: Once the desired configuration is defined, press **OK** to create nomenclature tables.
cs: Jakmile je požadované nastavení stanoveno, stiskněte **OK** pro vytvoření tabulek se seznamy součástí.

source: The project nomenclature can be created, modified and updated at any time.
cs: Seznam součástí projektu lze kdykoli vytvořit, upravit a aktualizovat.
