Repository: qelectrotech/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/new_project/conductor_settings.po
Languages: cs

source: Conductor settings
cs: Nastavení vodiče

source: QElectroTech provides the option to storage at the Data from the application some `project properties`_ pre-defined by the user. This feature allows the user avoiding to define many `project properties`_ each time that the user `creates new projects`_.
cs: QElectroTech poskytuje možnost ukládat na Data zaplikace některé `vlastnosti projektu`_ stanovené předem uživatelem. Tatofunkce umožňuje uživateli vyhnout se stanovení mnoha `vlastností projektu`_pokaždé, když uživatel `vytvoří nové projekty`_.

source: The **Conductor** tab from **New project** settings section allows pre-defining some `conductor properties`_:
cs: Karta **Vodič** z části s nastavením **Nový projekt** umožňuje stanovení některých `vlastností vodičů`_ předem:

source: `Conductor type`_ (`Multiline`_ or `Single line`_).
cs: `Typ vodiče`_ (`vícežilový`_ nebo `jednožilový`_).

source: `Conductor appearance`_.
cs: `Vzhled vodiče`_.

source: Figure: QElectroTech New project conductor settings
cs: Obrázek: Nastavení vodiče v novém projektu v QElectroTechu

source: To define conductor settings:
cs: Pro stanovení nastavení vodiče:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazení` vyskakovacího okna s nastavením QElectroTechu.

source: Go to **New project** section.
cs: Jděte do části **Nový projekt**.

source: Go to **Conductor** tab.
cs: Jděte na kartu **Vodič**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close settings PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavřete vyskakovací okno s nastavením.

source: All pre-defined conductor properties defined at QElectroTech settings PopUP window will be automatically defined during `project creation`_ at `project properties`_. The `conductor properties`_ can be found at `Conductor tab`_ from `New folio`_ section.
cs: Všechny předem stanovené vlastnosti vodičů stanovené ve vyskakovacím okně s nastavením QElectroTechu budou automaticky stanoveny během `vytváření projektu`_ ve `vlastnostech projektu`_. `Vlastnosti vodiče`_ najdete v`kartě vodič`_ v části `Nový list`_.
